In [4]:
import pandas as pd
#df = pd.read_csv("stock_data.csv", skiprows=1)
df = pd.read_csv("stock_data.csv", header=None, names = ["ticker","eps","revenue","price","people"])
df

    ticker            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [6]:
df = pd.read_csv("stock_data.csv", nrows = 3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [15]:
df = pd.read_csv("stock_data.csv", na_values = ["not available", "n.a.",-1])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [18]:
df = pd.read_csv("stock_data.csv", na_values = {
    'eps' : ["not available", "n.a."],
    'revenue' : ["not available", "n.a.",-1],
    'people' : ["not available", "n.a."]
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [22]:
df.to_csv('Sam_new.csv', index =False)

In [23]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [26]:
df.to_csv('Sam_new.csv', columns = ['tickers','eps'], index = False)

In [29]:
df.to_csv('Sam_new.csv', columns = ['tickers','eps'], index = False, header = False)

excel files